# Задача №9. Решение в группах
# По данному целому неотрицательному n вычислите
# значение n!. N! = 1 * 2 * 3 * … * N (произведение всех
# чисел от 1 до N) 0! = 1 Решить задачу используя цикл
# while
# Input: 5
# Output: 120

n = int(input('Введите чило N: '))
i = 0
f = 1
while i < n:
    i += 1
    f *= i
print(f'{n}! = {f}')
