# 1. Напишите программу, 
# которая принимает на вход два числа и проверяет, 
# является ли одно число квадратом другого.
# *Примеры:*
# - 5, 25 -> да
# - 4, 16 -> да
# - 25, 5 -> да
# - 8,9 -> нет

x= int(input('Введите чило x: '))
y= int(input('Введите чило y: '))
print(x**2 == y or y**2 == x)