# Задача №3. Решение в группах
# В некоторой школе решили набрать три новых
# математических класса и оборудовать кабинеты для
# них новыми партами. За каждой партой может сидеть
# два учащихся. Известно количество учащихся в
# каждом из трех классов. Выведите наименьшее
# число парт, которое нужно приобрести для них.
# Input: 20 21 22(ввод чисел НЕ в одну строку)
# Output: 32

a = 20
b = 21
c = 22
n = 2
d1 = (a + (n - 1)) // n
d2 = (b + (n - 1)) // n
d3 = (c + (n - 1)) // n
print(d1+d2+d3)

# a = int(input("Введите количество учеников в первом классе"))

# b = int(input("Введите количество учеников в втором классе"))

# c = int(input("Введите количество учеников в третьем классе"))

# print ("Количество парт = ", (( a + 1 ) // 2 + ( b + 1 ) // 2 + ( c + 1 ) // 2 ))