# Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
# Поскольку разобраться в его кричалки не настолько просто, насколько легко
# он их придумывает, Вам стоит написать программу. Винни-Пух считает, что ритм
# есть, если число слогов (т.е. число гласных букв) в каждой фразе стихотворения
# одинаковое. Фраза может состоять из одного слова, если во фразе несколько слов,
# то они разделяются дефисами. Фразы отделяются друг от друга пробелами. Стихотворение
# Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”, если
# с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке
# *Пример:*
# **Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да
#     **Вывод:** Парам пам-пам

#1способ

def count_str(list_1):
    counter=[]
    
    for phrase in list_1:
        count1=0
        for letter in phrase:
            if letter in russian_alphabet:
                count1+=1
        counter.append(count1)
        
       
    return counter
result=input("Введите строку ").lower().split()
print(result)
russian_alphabet={"а", "я", "у", "ю", "о", "е", "ё", "э", "и", "ы"}
result=count_str(result)
print(result)
result=set(result)
if len(result)==1:
    print("рифма есть")
else :
     print("рифмы нет")