# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы
# расплачивались за проезд и получали билет с номером. Счастливым
# билетом называют такой билет с шестизначным номером, где сумма
# первых трех цифр равна сумме последних трех. Т.е. билет с номером
# 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать
# программу, которая проверяет счастливость билета.
# 385916 -> yes
# 123456 -> no


from random import random
n = random() * 900000 + 100000
n = int(n)
print(n)

a1 = n // 100000
a2 = n // 10000 % 10
a3 = n // 1000 % 100 % 10
b1 = n // 100 % 1000 % 100 % 10
b2 = n // 10 % 10000 % 1000 % 100 % 10
b3 = n % 10
c1 = (a1 + a2 + a3)
c2 = (b1 + b2 + b3)

if (c1 == c2):
    print("Вам попался счастливый билет")
else:
    print("Вам попался несчастливый билет")
