# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

# n = input("Введите трехзначное число: ")
# n = int(n)

# n1 = n % 10
# n = n//10
# n2 = n % 10
# n = n//10
# print("Сумма цифр числа:", n + n1 + n2)


# n = input("Введите трехзначное число: ")
 
# a = int(n[0])
# b = int(n[1])
# c = int(n[2])
 
# print("Сумма цифр числа:", a + b + c)


from random import random
n = random() * 900 + 100
n = int(n)
print(n)
a = n // 100
b = (n // 10) % 10
c = n % 10
print(a+b+c)