# Задача 8: Требуется определить, можно ли от шоколадки размером n
# × m долек отломить k долек, если разрешается сделать один разлом по
# прямой между дольками (то есть разломить шоколадку на два
# прямоугольника).
# 3 2 4 -> yes
# 3 2 1 -> no

n = int(input('В-те 1-ю сторону: '))
m = int(input('В-те 2-ю сторону: '))
k = int(input('В-те кол-во долек: '))

if k%n == 0 or k%m == 0:
    print('Yes')
else: print('No')
