# Задача №37. Решение в группах
# Дано натуральное число N и
# последовательность из N элементов.
# Требуется вывести эту последовательность в
# обратном порядке.
# Примечание. В программе запрещается
# объявлять массивы и использовать циклы
# (даже для ввода и вывода).
# Input: 2 -> 3 4
# Output: 4 3

# def f(n):
#     if n == 0:
#         print()
#         return
#     k = int(input("Введите элемент = "))
#     f(n-1)
#     print(k, end=' ')

# n = int(input("Введите число N = "))
# f(n)

def f(n):
        if n == 0:
            return ''
        k = int(input("Введите элемент = "))
        return f(n - 1) + f' {k}'
# return f(n-1) + ' ' + str(k)

n = int(input("Введите число N = "))
print(f(n)[1:])