# Задача №35. Решение в группах
# Напишите функцию, которая принимает одно число и
# проверяет, является ли оно простым
# Напоминание: Простое число - это число, которое
# имеет 2 делителя: 1 и n(само число)
# Input: 5
# Output: yes 
def check_number(n):
    if n==1:
        return "нет"
    for i in range(2,int(n**0.5)+1):
        if n%i==0:
            return "нет"
    return "да"
print(check_number(int(input("число = "))))