# Задача 18: Требуется найти в массиве A[1..N] 
# самый близкий по величине элемент к заданному числу X. 
# Пользователь в первой строке вводит натуральное число 
# N – количество элементов в массиве. В последующих  
# строках записаны N целых чисел Ai. 
# Последняя строка содержит число X

# *Пример:*
# 5
# 1 2 3 4 5
# 6
# -> 5

from random import randint
n = int (input("Введите количество элементов "))
x = int (input("Введите число X: "))
list_1 = [randint(1, 10) for _ in range(n)]
min = abs(x - list_1[0])
index = 0
for i in range(1, n):
    count = abs(x - list_1[i])
    if count < min:
        min = count
        index = i
print(list_1)
print(f'Число {list_1[index]} в списке наиболее близко по величине к числу {x}')